geCalculateNormal(OdArray&lt;OdGePoint3d,OdMemoryAllocator&lt;OdGePoint3d&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d*,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the normal to the plane defined by the specified points.
\param points [in]  Array of 3D points.
\param numPoints [in]  Number of points.
\param pNormal [out]  Receives the normal to the calculated plane.
\param tol [in]  Geometric tolerance.
\remarks
Possible return values are as follows:
@untitled table
kOk
kNonCoplanarGeometry
kDegenerateGeometry
kSingularPoint
Corresponding C++ library: TD_Ge